/**************************************************************************
 *   文件名	：qgeoserviceproviderfactory_tiandidu.cpp
 *   =======================================================================
 *   创 建 者	：田小帆
 *   创建日期	：2021-7-4
 *   邮   箱	：499131808@qq.com
 *   Q Q		：499131808
 *   公   司      
 *   功能描述      ：
 *   使用说明 ：
 *   ======================================================================
 *   修改者	：
 *   修改日期	：
 *   修改内容	：
 *   ======================================================================
 *
 ***************************************************************************/
#include "qgeoserviceproviderfactory_tiandidu.h"

QGeoServiceProviderFactoryTiandidu::QGeoServiceProviderFactoryTiandidu()
{

}
