/**************************************************************************
 *   文件名	：TiMapTile.h
 *   =======================================================================
 *   创 建 者	：田小帆
 *   创建日期	：2021-7-31
 *   邮   箱	：499131808@qq.com
 *   Q Q		：499131808
 *   公   司
 *   功能描述      ：
 *   使用说明 ：任何人或机构要使用、修改、发布本源代码,
 *   ======================================================================
 *   修改者	：
 *   修改日期	：
 *   修改内容	：
 *   ======================================================================
 *
 ***************************************************************************/
#pragma once
#include <QObject>

class TiMapTile : public QObject
{
    Q_OBJECT
public:
    quint32    hash;
    QString    format;
    QByteArray byte;
    int        x;
    int        y;
    int        zoom;
    quint32    mapID;
};
